Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Muhsin Khan.tmx
Source language: ar
Languages: en

source: الذي خلق سبع سماوات طباقا ما ترى في خلق الرحمن من تفاوت فارجع البصر هل ترى من فطور
en: Who has created the seven heavens one above another; you can see no fault in the creation of the Most Gracious. Then look again: "Can you see any rifts?"

source: ثم ارجع البصر كرتين ينقلب إليك البصر خاسئا وهو حسير
en: Then look again and yet again: your sight will return to you in a state of humiliation and worn out.

source: ولقد زينا السماء الدنيا بمصابيح وجعلناها رجوما للشياطين وأعتدنا لهم عذاب السعير
en: And indeed We have adorned the nearest heaven with lamps , and We have made such lamps (as) missiles to drive away the Shayatin (devils), and have prepared for them the torment of the blazing Fire.

source: وللذين كفروا بربهم عذاب جهنم وبئس المصير
en: And for those who disbelieve in their Lord (Allah) is the torment of Hell, and worst indeed is that destination.

source: إذا ألقوا فيها سمعوا لها شهيقا وهي تفور
en: When they are cast therein, they will hear the (terrible) drawing in of its breath as it blazes forth.

source: تكاد تميز من الغيظ كلما ألقي فيها فوج سألهم خزنتها ألم يأتكم نذير
en: It almost bursts up with fury. Every time a group is cast therein, its keeper will ask: "Did no warner come to you?"

source: قالوا بلى قد جاءنا نذير فكذبنا وقلنا ما نزل الله من شيء إن أنتم إلا في ضلال كبير
en: They will say: "Yes, indeed a warner did come to us, but we belied him and said: 'Allah never sent down anything (of revelation); you are only in great error.'"

source: وقالوا لو كنا نسمع أو نعقل ما كنا في أصحاب السعير
en: And they will say: "Had we but listened or used our intelligence, we would not have been among the dwellers of the blazing Fire!"

source: فاعترفوا بذنبهم فسحقا لأصحاب السعير
en: Then they will confess their sin. So, away with the dwellers of the blazing Fire!

source: إن الذين يخشون ربهم بالغيب لهم مغفرة وأجر كبير
en: Verily,, those who fear their Lord unseen (i.e. they do not see Him, nor His punishment in the Hereafter), theirs will be forgiveness and a great reward (i.e. Paradise).

source: وأسروا قولكم أو اجهروا به إنه عليم بذات الصدور
en: And whether you keep your talk secret or disclose it, Verily, He is the All-Knower of what is in the breasts (of men).

source: ألا يعلم من خلق وهو اللطيف الخبير
en: Should not He Who has created know? And He is the Most Kind and Courteous (to His slaves), All-Aware (of everything).

source: هو الذي جعل لكم الأرض ذلولا فامشوا في مناكبها وكلوا من رزقه وإليه النشور
en: He it is Who has made the earth subservient to you (i.e. easy for you to walk, to live and to do agriculture on it); so walk in the path thereof and eat of His provision. And to Him will be the Resurrection.

source: أأمنتم من في السماء أن يخسف بكم الأرض فإذا هي تمور
en: Do you feel secure that He, Who is over the heaven (Allah), will not cause the earth to sink with you, and then it should quake?

source: أم أمنتم من في السماء أن يرسل عليكم حاصبا فستعلمون كيف نذير
en: Or do you feel secure that He, Who is over the heaven (Allah), will not send against you a violent whirlwind? Then you shall know how (terrible) has been My Warning.

source: ولقد كذب الذين من قبلهم فكيف كان نكير
en: And indeed those before them belied (the Messengers of Allah), then how terrible was My denial (punishment)?

source: أولم يروا إلى الطير فوقهم صافات ويقبضن ما يمسكهن إلا الرحمن إنه بكل شيء بصير
en: Do they not see the birds above them, spreading out their wings and folding them in? None upholds them except the Most Gracious (Allah). Verily, He is the All-Seer of everything.

source: أمن هذا الذي هو جند لكم ينصركم من دون الرحمن إن الكافرون إلا في غرور
en: Who is he besides the Most Gracious that can be an army to you to help you? The disbelievers are in nothing but delusion.

source: أمن هذا الذي يرزقكم إن أمسك رزقه بل لجوا في عتو ونفور
en: Who is he that can provide for you if He should withhold His provision? Nay, but they continue to be in pride, and (they) flee (from the truth).

source: أفمن يمشي مكبا على وجهه أهدى أمن يمشي سويا على صراط مستقيم
en: Is he who walks prone (without seeing) on his face, more rightly guided, or he who (sees and) walks upright on the Straight Way (i.e. Islamic Monotheism)?

source: قل هو الذي أنشأكم وجعل لكم السمع والأبصار والأفئدة قليلا ما تشكرون
en: Say it is He Who has created you, and endowed you with hearing (ears) and seeing (eyes), and hearts. Little thanks you give.

source: قل هو الذي ذرأكم في الأرض وإليه تحشرون
en: Say: "It is He Who has created you on the earth, and to Him shall you be gathered (in the Hereafter)."

source: قل إنما العلم عند الله وإنما أنا نذير مبين
en: Say (O Muhammad صلى الله عليه وسلم): "The knowledge (of its exact time) is with Allah only, and I am only a plain warner."

source: فلما رأوه زلفة سيئت وجوه الذين كفروا وقيل هذا الذي كنتم به تدعون
en: But when they will see it (the torment on the Day of Resurrection) approaching, the faces of those who disbelieve will change and turn black with sadness and in grief and it will be said (to them): "This is (the promise) which you were calling for!"

source: قل أرأيتم إن أهلكني الله ومن معي أو رحمنا فمن يجير الكافرين من عذاب أليم
en: Say (O Muhammad صلى الله عليه وسلم): "Tell me! If Allah destroys me, and those with me, or He bestows His Mercy on us - who can save the disbelievers from a painful torment?"

source: قل هو الرحمن آمنا به وعليه توكلنا فستعلمون من هو في ضلال مبين
en: Say: "He is the Most Gracious (Allah), in Him we believe, and in Him we put our trust. So you will come to know who it is that is in manifest error."

source: قل أرأيتم إن أصبح ماؤكم غورا فمن يأتيكم بماء معين
en: Say (O Muhammad صلى الله عليه وسلم): "Tell me! If (all) your water were to sink away, who then can supply you with flowing (spring) water?"

source: ن والقلم وما يسطرون
en: Nun. [These letters (Nun, etc.) are one of the miracles of the Qur'an, and none but Allah (Alone) knows their meanings]. By the pen and by what they (the angels) write (in the Records of men).

source: ما أنت بنعمة ربك بمجنون
en: You (O Muhammad صلى الله عليه وسلم), by the Grace of your Lord, are not mad.

source: وإن لك لأجرا غير ممنون
en: And Verily, for you (O Muhammad صلى الله عليه وسلم) will be an endless reward.

source: وإنك لعلى خلق عظيم
en: And Verily, you (O Muhammad صلى الله عليه وسلم) are on an exalted (standard of) character.

source: فستبصر ويبصرون
en: You will see, and they will see,

source: بأييكم المفتون
en: Which of you is afflicted with madness.

source: إن ربك هو أعلم بمن ضل عن سبيله وهو أعلم بالمهتدين
en: Verily, your Lord is the Best Knower of him who has gone astray from His Path, and He is the Best Knower of those who are guided.

source: فلا تطع المكذبين
en: So (O Muhammad صلى الله عليه وسلم) obey you not the deniers [(of Islamic Monotheism - those who belie the Verses of Allah), the Oneness of Allah, and the Messengership of Muhammad صلى الله عليه وسلم]

source: ودوا لو تدهن فيدهنون
en: They wish that you should compromise (in religion out of courtesy) with them: so they (too) would compromise with you.

source: ولا تطع كل حلاف مهين
en: And (O Muhammad صلى الله عليه وسلم) obey you not everyone Hallaf Mahin (the one who swears much and is a liar or is worthless). [Tafsir At-Tabari]

source: هماز مشاء بنميم
en: A slanderer, going about with calumnies,

source: مناع للخير معتد أثيم
en: Hinderer of the good, transgressor, sinful,

source: عتل بعد ذلك زنيم
en: Cruel, and moreover base-born (of illegitimate birth).

source: أن كان ذا مال وبنين
en: (He was so) because he had wealth and children.

source: إذا تتلى عليه آياتنا قال أساطير الأولين
en: When Our Verses (of the Qur'an) are recited to him, he says: "Tales of the men of old!"

source: سنسمه على الخرطوم
en: We shall brand him on the snout (nose)!

source: إنا بلوناهم كما بلونا أصحاب الجنة إذ أقسموا ليصرمنها مصبحين
en: Verily, We have tried them as We tried the people of the garden, when they swore to pluck the fruits of the (garden) in the morning,

source: ولا يستثنون
en: Without saying: Insha' Allah (If Allah wills).

source: فطاف عليها طائف من ربك وهم نائمون
en: Then there passed by on the (garden) a visitation (fire) from your Lord at night and burnt it while they were asleep.

source: فأصبحت كالصريم
en: So the (garden) became black by the morning, like a pitch dark night (in complete ruins).

source: فتنادوا مصبحين
en: Then they called out one to another as soon as the morning broke.

source: أن اغدوا على حرثكم إن كنتم صارمين
en: Saying: "Go to your tilth in the morning, if you would pluck the fruits."

source: فانطلقوا وهم يتخافتون
en: So they departed, conversing in secret low tones (saying):

source: أن لا يدخلنها اليوم عليكم مسكين
en: "No Miskin (poor man) shall enter upon you into it today."

source: وغدوا على حرد قادرين
en: And they went in the morning with strong intention, thinking that they have power (to prevent the poor taking anything of the fruits therefrom).

source: فلما رأوها قالوا إنا لضالون
en: But when they saw the (garden), they said: "Verily, we have gone astray."

source: قال أوسطهم ألم أقل لكم لولا تسبحون
en: The best among them said: "Did I not tell you: why say you not: Insha' Allah (If Allah wills)."

source: قالوا سبحان ربنا إنا كنا ظالمين
en: They said: "Glory to Our Lord! Verily, we have been Zalimun (wrong-doers)."

source: فأقبل بعضهم على بعض يتلاومون
en: Then they turned one against another, blaming.

source: قالوا يا ويلنا إنا كنا طاغين
en: They said: "Woe to us! Verily, we were Taghun (transgressors and disobedient)

source: عسى ربنا أن يبدلنا خيرا منها إنا إلى ربنا راغبون
en: We hope that our Lord will give us in exchange a better (garden) than this. Truly, we turn to our Lord (wishing for good that He may forgive our sins and reward us in the Hereafter).

source: كذلك العذاب ولعذاب الآخرة أكبر لو كانوا يعلمون
en: Such is the punishment (in this life), but truly, the punishment of the Hereafter is greater if they but knew.

source: إن للمتقين عند ربهم جنات النعيم
en: Verily, for the Muttaqun (the pious - See V.2:2) are Gardens of delight (Paradise) with their Lord.

source: أفنجعل المسلمين كالمجرمين
en: Shall We then treat the Muslims (believers of Islamic Monotheism, doers of righteous deeds) like the Mujrimun (criminals, polytheists and disbelievers, etc.)?

source: أم لكم كتاب فيه تدرسون
en: Or have you a Book wherein you learn,

source: إن لكم فيه لما تخيرون
en: That you shall therein have all that you choose?

source: أم لكم أيمان علينا بالغة إلى يوم القيامة إن لكم لما تحكمون
en: Or have you oaths from Us, reaching to the Day of Resurrection, that yours will be what you judge?

source: سلهم أيهم بذلك زعيم
en: Ask them, which of them will stand surety for that!

source: أم لهم شركاء فليأتوا بشركائهم إن كانوا صادقين
en: Or have they "partners"? Then let them bring their "partners" if they are truthful!

source: يوم يكشف عن ساق ويدعون إلى السجود فلا يستطيعون
en: (Remember) the Day when the Shin shall be laid bare (i.e. the Day of Resurrection) and they shall be called to prostrate themselves (to Allah), but they (hypocrites) shall not be able to do so.

source: خاشعة أبصارهم ترهقهم ذلة وقد كانوا يدعون إلى السجود وهم سالمون
en: Their eyes will be cast down and ignominy will cover them; they used to be called to prostrate themselves (offer prayers), while they were healthy and good (in the life of the world, but they did not).

source: فذرني ومن يكذب بهذا الحديث سنستدرجهم من حيث لا يعلمون
en: Then leave Me Alone with such as belie this Qur'an. We shall punish them gradually from directions they perceive not.

source: فاصبر لحكم ربك ولا تكن كصاحب الحوت إذ نادى وهو مكظوم
en: So wait with patience for the Decision of your Lord, and be not like the Companion of the Fish - when he cried out (to Us) while he was in deep sorrow. (See the Qur'an, Verse 21:87).

source: لولا أن تداركه نعمة من ربه لنبذ بالعراء وهو مذموم
en: Had not a Grace from his Lord reached him, he would indeed have been (left in the stomach of the fish, but We forgave him): so he was cast off on the naked shore, while he was to be blamed.

source: فاجتباه ربه فجعله من الصالحين
en: Then his Lord chose him and made him of the righteous.

source: وإن يكاد الذين كفروا ليزلقونك بأبصارهم لما سمعوا الذكر ويقولون إنه لمجنون
en: And verily, those who disbelieve would almost make you slip with their eyes (through hatred) when they hear the Reminder (the Qur'an), and they say: "Verily, he (Muhammad صلى الله عليه وسلم) is a madman!"

source: وما هو إلا ذكر للعالمين
en: But it is nothing else than a Reminder to all the 'Alamin (mankind, and jinn).

source: الحاقة
en: The Inevitable (i.e. the Day of Resurrection)!

source: ما الحاقة
en: What is the Inevitable?

source: وما أدراك ما الحاقة
en: And what will make you know what the Inevitable is?

source: كذبت ثمود وعاد بالقارعة
en: Thamud and 'Ad people denied the Qari'ah (the striking Hour of Judgement)!

source: فأما ثمود فأهلكوا بالطاغية
en: As for Thamud, they were destroyed by the awful cry!

source: وأما عاد فأهلكوا بريح صرصر عاتية
en: And as for 'Ad, they were destroyed by a furious violent wind!

source: سخرها عليهم سبع ليال وثمانية أيام حسوما فترى القوم فيها صرعى كأنهم أعجاز نخل خاوية
en: Which Allah imposed on them for seven nights and eight days in succession, so that you could see men lying overthrown (destroyed), as if they were hollow trunks of date-palms!

source: فهل ترى لهم من باقية
en: Do you see any remnants of them?

source: وجاء فرعون ومن قبله والمؤتفكات بالخاطئة
en: And Fir'aun (Pharaoh), and those before him, and the cities overthrown [the towns of the people of [Lut (Lot)] committed sin.

source: فعصوا رسول ربهم فأخذهم أخذة رابية
en: And they disobeyed their Lord's Messenger, so He seized them with a strong punishment.

source: إنا لما طغى الماء حملناكم في الجارية
en: Verily, when the water rose beyond its limits [Nuh's (Noah) Flood], We carried you (mankind) in the floating [ship that was constructed by Nuh (Noah)]

source: لنجعلها لكم تذكرة وتعيها أذن واعية
en: That We might make it (Noah's ship) an admonition for you and that it might be retained by the retaining ears.

source: فإذا نفخ في الصور نفخة واحدة
en: Then when the Trumpet will be blown with one blowing (the first one).

source: وحملت الأرض والجبال فدكتا دكة واحدة
en: And the earth and the mountains shall be removed from their places, and crushed with a single crushing.

source: فيومئذ وقعت الواقعة
en: Then on that Day shall the (Great) Event befall.

source: وانشقت السماء فهي يومئذ واهية
en: And the heaven will be rent asunder, for that Day it (the heaven) will be frail and torn up.

source: والملك على أرجائها ويحمل عرش ربك فوقهم يومئذ ثمانية
en: And the angels will be on its sides, and eight angels will, that Day, bear the Throne of your Lord above them.

source: يومئذ تعرضون لا تخفى منكم خافية
en: That Day shall you be brought to Judgement, not a secret of you will be hidden.

source: فأما من أوتي كتابه بيمينه فيقول هاؤم اقرءوا كتابيه
en: Then as for him who will be given his Record in his right hand will say: "Here! read my Record!

source: إني ظننت أني ملاق حسابيه
en: "Surely, I did believe that I shall meet my Account!"

source: فهو في عيشة راضية
en: So he shall be in a life, well-pleasing.

source: في جنة عالية
en: In a lofty Paradise,

source: قطوفها دانية
en: The fruits in bunches whereof will be low and near at hand.

source: كلوا واشربوا هنيئا بما أسلفتم في الأيام الخالية
en: Eat and drink at ease for that which you have sent on before you in days past!

source: وأما من أوتي كتابه بشماله فيقول يا ليتني لم أوت كتابيه
en: But as for him who will be given his Record in his left hand, will say: "I wish that I had not been given my Record!

source: ولم أدر ما حسابيه
en: "And that I had never known how my Account is!

source: يا ليتها كانت القاضية
en: "Would that it had been my end (death)!

source: ما أغنى عني ماليه
en: "My wealth has not availed me;

source: هلك عني سلطانيه
en: "My power (and arguments to defend myself) have gone from me!"

source: خذوه فغلوه
en: (It will be said): "Seize him and fetter him;

source: ثم الجحيم صلوه
en: Then throw him in the blazing Fire.

source: ثم في سلسلة ذرعها سبعون ذراعا فاسلكوه
en: "Then fasten him with a chain whereof the length is seventy cubits!"

source: إنه كان لا يؤمن بالله العظيم
en: Verily, he used not to believe in Allah, the Most Great,

source: ولا يحض على طعام المسكين
en: And urged not on the feeding of Al-Miskin (the poor).

source: فليس له اليوم هاهنا حميم
en: So no friend has he here this Day,

source: ولا طعام إلا من غسلين
en: Nor any food except filth from the washing of wounds.

source: لا يأكله إلا الخاطئون
en: None will eat it except the Khati'un (sinners, disbelievers, polytheists).

source: فلا أقسم بما تبصرون
en: So I swear by whatsoever you see,

source: وما لا تبصرون
en: And by whatsoever you see not,

source: إنه لقول رسول كريم
en: That this is verily, the word of an honoured Messenger [i.e. Jibril (Gabriel) or Muhammad صلى الله عليه وسلم which he has brought from Allah].

source: وما هو بقول شاعر قليلا ما تؤمنون
en: It is not the word of a poet: little is that you believe!

source: ولا بقول كاهن قليلا ما تذكرون
en: Nor is it the word of a soothsayer (or a foreteller): little is that you remember!

source: ولو تقول علينا بعض الأقاويل
en: And if he (Muhammad صلى الله عليه وسلم) had forged a false saying concerning Us (Allah جل جلاله),

source: لأخذنا منه باليمين
en: We surely would have seized him by his right hand (or with power and might),

source: ثم لقطعنا منه الوتين
en: And then We certainly would have cut off his life artery (aorta),

source: فما منكم من أحد عنه حاجزين
en: And none of you could have withheld Us from (punishing) him.

source: وإنه لتذكرة للمتقين
en: And verily, this (Qur'an) is a Reminder for the Muttaqun (the pious. See V.2:2).

source: وإنا لنعلم أن منكم مكذبين
en: And verily, We know that there are some among you that belie (this Qur'an). (Tafsir At-Tabari)

source: وإنه لحسرة على الكافرين
en: And indeed it (this Qur'an) will be an anguish for the disbelievers (on the Day of Resurrection).

source: وإنه لحق اليقين
en: And verily, it (this Qur'an) is an absolute truth with certainty.

source: سأل سائل بعذاب واقع
en: A questioner asked concerning a torment about to befall

source: للكافرين ليس له دافع
en: Upon the disbelievers, which none can avert,

source: من الله ذي المعارج
en: From Allah, the Lord of the ways of ascent.

source: تعرج الملائكة والروح إليه في يوم كان مقداره خمسين ألف سنة
en: The angels and the Ruh [Jibril (Gabriel)] ascend to Him in a Day the measure whereof is fifty thousand years.

source: فاصبر صبرا جميلا
en: So be patient (O Muhammad صلى الله عليه وسلم), with a good patience.

source: إنهم يرونه بعيدا
en: Verily, they see it (the torment) afar off.

source: ونراه قريبا
en: But We see it (quite) near.

source: يوم تكون السماء كالمهل
en: The Day that the sky will be like the boiling filth of oil, (or molten copper or silver or lead).

source: وتكون الجبال كالعهن
en: And the mountains will be like flakes of wool.

source: ولا يسأل حميم حميما
en: And no friend will ask a friend (about his condition),

source: يبصرونهم يود المجرم لو يفتدي من عذاب يومئذ ببنيه
en: Though they shall be made to see one another [(i.e. on the Day of Resurrection), there will be none but see his father, children and relatives, but he will neither speak to them nor will ask them for any help]. The Mujrim, (criminal, sinner, disbeliever) would desire to ransom himself from the punishment of that Day by his children,

source: وصاحبته وأخيه
en: And his wife and his brother,

source: وفصيلته التي تؤويه
en: And his kindred who sheltered him,

source: ومن في الأرض جميعا ثم ينجيه
en: And all that are in the earth, so that it might save him.

source: كلا إنها لظى
en: By no means! Verily, it will be the Fire of Hell,

source: نزاعة للشوى
en: Taking away (burning completely) the head skin!

source: تدعو من أدبر وتولى
en: Calling (all) such as turn their backs and turn away their faces (from Faith) [picking and swallowing them up from that great gathering of mankind on the Day of Resurrection just as a bird picks up a food-grain from the earth with its beak and swallows it up] (Tafsir Al-Qurtubi)

source: وجمع فأوعى
en: And collect (wealth) and hide it (from spending it in the Cause of Allah).

source: إن الإنسان خلق هلوعا
en: Verily, man (disbeliever) was created very impatient;

source: إذا مسه الشر جزوعا
en: Irritable (discontented) when evil touches him;

source: وإذا مسه الخير منوعا
en: And niggardly when good touches him.

source: إلا المصلين
en: Except those who are devoted to Salat (prayers).

source: الذين هم على صلاتهم دائمون
en: Those who remain constant in their Salat (prayers);

source: والذين في أموالهم حق معلوم
en: And those in whose wealth there is a recognised right

source: للسائل والمحروم
en: For the beggar who asks, and for the unlucky who has lost his property and wealth, (and his means of living has been straitened).

source: والذين يصدقون بيوم الدين
en: And those who believe in the Day of Recompense.

source: والذين هم من عذاب ربهم مشفقون
en: And those who fear the torment of their Lord.

source: إن عذاب ربهم غير مأمون
en: Verily, the torment of their Lord is that before which none can feel secure. -

source: والذين هم بشهاداتهم قائمون
en: And those who stand firm in their testimonies.

source: والذين هم على صلاتهم يحافظون
en: And those who guard their Salat (prayers) well.

source: أولئك في جنات مكرمون
en: Such shall dwell in the Gardens (i.e. Paradise), honoured.

source: فمال الذين كفروا قبلك مهطعين
en: So what is the matter with those who disbelieve that they hasten to listen from you [O Muhammad صلى الله عليه وسلم), in order to belie you and to mock at you, and at Allah's Book (this Qur'an)].

source: عن اليمين وعن الشمال عزين
en: (Sitting) in groups on the right and on the left (of you, O Muhammad صلى الله عليه وسلم)?

source: أيطمع كل امرئ منهم أن يدخل جنة نعيم
en: Does every man of them hope to enter the Paradise of Delight?

source: كلا إنا خلقناهم مما يعلمون
en: No, that is not like that! Verily, We have created them out of that which they know!

source: فلا أقسم برب المشارق والمغارب إنا لقادرون
en: So I swear by the Lord of all the [three hundred and sixty-five (365)] points of sunrise and sunset in the east and the west that surely We are Able

source: على أن نبدل خيرا منهم وما نحن بمسبوقين
en: To replace them by (others) better than them; and We are not to be outrun.

source: يوم يخرجون من الأجداث سراعا كأنهم إلى نصب يوفضون
en: The Day when they will come out of the graves quickly as racing to a goal,

source: خاشعة أبصارهم ترهقهم ذلة ذلك اليوم الذي كانوا يوعدون
en: With their eyes lowered in fear and humility, ignominy covering them (all over)! That is the Day which they were promised!

source: إنا أرسلنا نوحا إلى قومه أن أنذر قومك من قبل أن يأتيهم عذاب أليم
en: Verily, We sent Nuh (Noah) to his people (saying): "Warn your people before there comes to them a painful torment."

source: قال يا قوم إني لكم نذير مبين
en: He said: "O my people! Verily, I am a plain warner to you,

source: أن اعبدوا الله واتقوه وأطيعون
en: "That you should worship Allah (Alone), fear (be dutiful to) Him, and obey me,

source: يغفر لكم من ذنوبكم ويؤخركم إلى أجل مسمى إن أجل الله إذا جاء لا يؤخر لو كنتم تعلمون
en: "He (Allah) will forgive you of your sins and respite you to an appointed term. Verily, the term of Allah when it comes, cannot be delayed, if you but knew."

source: قال رب إني دعوت قومي ليلا ونهارا
en: He said: "O my Lord! Verily, I have called to my people night and day (i.e. secretly and openly to accept the doctrine of Islamic Monotheism),

source: فلم يزدهم دعائي إلا فرارا
en: "But all my calling added nothing but to (their) flight (from the truth).
